# PyCitySchools Challenge

In [2]:
# import libraries
import pandas as pd
from pathlib import Path

In [3]:
# Set path for files
File_path_school = Path("Resources/schools_complete.csv")
File_path_students = Path("Resources/students_complete.csv")

In [4]:
# Open and read csv files
df_school = pd.read_csv (File_path_school)
df_students = pd.read_csv (File_path_students)

In [5]:
df_school.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
df_students.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

# District Summary

In [7]:
#Total number of unique schools
Total_number_of_unique_schools = len(df_school["school_name"].unique())
Total_number_of_unique_schools

15

In [8]:
# Total students
Total_students = df_students["Student ID"].count()
Total_students

39170

In [9]:
# Total budget
Total_budget = df_school["budget"].sum()
Total_budget

24649428

In [10]:
# Average math score
Average_math_score = df_students["math_score"].mean()
Average_math_score

78.98537145774827

In [11]:
# Average reading score

Average_reading_score = df_students["reading_score"].mean()
Average_reading_score

81.87784018381414

In [12]:
# % passing math (the percentage of students who passed math)
passing_math_Percentage = (len(df_students.loc[df_students["math_score"]>=70])/len(df_students["math_score"]))*100
passing_math_Percentage

74.9808526933878

In [13]:
# % passing reading (the percentage of students who passed reading)
# As the numbers of rows are equals for each column
passing_reading_Percentage = (len(df_students.loc[df_students["reading_score"]>=70])/Total_students)*100
passing_reading_Percentage

85.80546336482001

In [14]:
# % overall passing (the percentage of students who passed math AND reading)
overall_passing_Percentage = len(df_students.loc[(df_students["math_score"]>=70)&(df_students["reading_score"]>=70)])/Total_students*100
overall_passing_Percentage

65.17232575950983

In [16]:
# Create a new DataFrame
district_summary = pd.DataFrame ({"Total_number_schools":[Total_number_of_unique_schools],
                                 "Total_students":[Total_students],
                                 "Total_budget":[Total_budget],
                                 "Average_mathscore":[Average_math_score],
                                 "Average_readingscore":[Average_reading_score],
                                 "passing_math_percentage":[passing_math_Percentage],
                                 "passing_reading_percentage":[passing_reading_Percentage],
                                 "overall_passing_percentage":[overall_passing_Percentage]
                                 })
district_summary

,Total_number_schools,Total_students,Total_budget,Average_mathscore,Average_readingscore,passing_math_percentage,passing_reading_percentage,overall_passing_percentage
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [ ]:
# mapping

# School Summary

In [20]:
df_school.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [25]:
# merge the tables
merged_table = pd.merge(df_students,df_school,on ="school_name",how = "left")
merged_table.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [26]:
merged_table.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [28]:
merged_table.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [30]:
merged_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39170 entries, 0 to 39169
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student ID     39170 non-null  int64
 1   student_name   39170 non-null  object
 2   gender         39170 non-null  object
 3   grade          39170 non-null  object
 4   school_name    39170 non-null  object
 5   reading_score  39170 non-null  int64
 6   math_score     39170 non-null  int64
 7   School ID      39170 non-null  int64
 8   type           39170 non-null  object
 9   size           39170 non-null  int64
 10  budget         39170 non-null  int64
dtypes: int64(6), object(5)
memory usage: 3.3+ MB

In [31]:
merged_table_copy = merged_table.copy()
merged_table_copy

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [34]:
grouped_merged_table_copy = merged_table_copy.groupby("school_name")
grouped_merged_table_copy.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
37535,37535,Norma Mata,F,10th,Thomas High School,76,76,14,Charter,1635,1043130
37536,37536,Cody Miller,M,11th,Thomas High School,84,82,14,Charter,1635,1043130
37537,37537,Erik Snyder,M,9th,Thomas High School,80,90,14,Charter,1635,1043130
37538,37538,Tanya Martinez,F,9th,Thomas High School,71,69,14,Charter,1635,1043130
37539,37539,Noah Erickson,M,9th,Thomas High School,86,76,14,Charter,1635,1043130

In [35]:
# Total students

Total_students_grouped = grouped_merged_table_copy["student_name"].count()
Total_students_grouped

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: student_name, dtype: int64

In [36]:
# Total school budget

Total_school_budget_grouped = grouped_merged_table_copy["budget"].sum()
Total_school_budget_grouped

school_name
Bailey High School       15549641728
Cabrera High School       2009159448
Figueroa High School      5557128039
Ford High School          4831365924
Griffin High School       1346890000
Hernandez High School    14007062700
Holden High School         105933149
Huang High School         5573322295
Johnson High School      14733628650
Pena High School           563595396
Rodriguez High School    10186904637
Shelton High School       1860672600
Thomas High School        1705517550
Wilson High School        3012587442
Wright High School        1888920000
Name: budget, dtype: int64

In [37]:
# Per student budget
budget_per_student = Total_school_budget_grouped/Total_students_grouped
budget_per_student

school_name
Bailey High School       3124928.0
Cabrera High School      1081356.0
Figueroa High School     1884411.0
Ford High School         1763916.0
Griffin High School       917500.0
Hernandez High School    3022020.0
Holden High School        248087.0
Huang High School        1910635.0
Johnson High School      3094650.0
Pena High School          585858.0
Rodriguez High School    2547363.0
Shelton High School      1056600.0
Thomas High School       1043130.0
Wilson High School       1319574.0
Wright High School       1049400.0
dtype: float64

In [38]:
# Average math score
Average_math_score_grouped = grouped_merged_table_copy["math_score"].mean()
Average_math_score_grouped

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [39]:
# Average reading score
Average_reading_score_grouped = grouped_merged_table_copy["reading_score"].mean()
Average_reading_score_grouped

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [41]:
# % passing math (the percentage of students who passed math)
condition_1 = grouped_merged_table_copy["math_score"]>=70
passing_math_grouped = len(grouped_merged_table_copy.loc[condition_1])/Total_students_grouped
passing_math_grouped = passing_math_grouped*100
passing_math_grouped

TypeError: '>=' not supported between instances of 'SeriesGroupBy' and 'int'